#+SEQ_TODO: THIS_IS_GOLD WILL_WORK_ON_IT | INCOMPLETE DONE


** Transparency
      Make emacs transparent.
#+begin_src text
(set-frame-parameter (selected-frame) 'alpha `(90,90))
(add-to-list 'default-frame-alist `(alpha . (90, 90)))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

#+RESULTS:
: ((fullscreen . maximized) (alpha 90 90) (vertical-scroll-bars) (left-fringe . 3) (right-fringe . 3) (buffer-predicate . exwm-layout--other-buffer-predicate))
* All The Icons
Show icons. Doom modeline and counsel-M-x uses them.
  #+begin_src emacs-lisp
    (use-package all-the-icons
      :ensure t)

    (all-the-icons-wicon "tornado" :face 'all-the-icons-blue)
  #+end_src

  #+RESULTS:
  : 
*** code
#+BEGIN_SRC emacs-lisp
(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+END_SRC

#+RESULTS:
| org-bullets-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

*** Time format
#+BEGIN_SRC emacs-lisp
  (setq display-time-24hr-format nil)
  (setq display-time-format "%H:%M - %d %B %Y")
#+END_SRC

#+RESULTS:
: %H:%M - %d %B %Y

* Enable line number on programming modes
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook 'linum-mode)
#+end_src

#+RESULTS:
| linum-mode | linum-relative-mode |
* Indentation in  C++ code
  [[https://stackoverflow.com/questions/823745/how-do-i-make-emacs-auto-indent-my-c-code][source]]
#+begin_src emacs-lisp
  (defun set-ENTER-indentation ()
    (local-set-key (kbd "RET") 'newline-and-indent))

  (add-hook 'c-mode-hook 'set-ENTER-indentation)
#+end_src

#+RESULTS:
| set-ENTER-indentation |
